Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/getting-started_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: This page is an overview of the React documentation and related resources.
ja: このページは React のドキュメント、および関連する資料の概要となります。

source: **React** is a JavaScript library for building user interfaces.
ja: **React** はユーザインターフェースを作成する為の JavaScript のライブラリです。

source: Learn what React is all about on [our homepage](/) or [in the tutorial](/tutorial/tutorial.html).
ja: [ここのホームページ](/)、または[このチュートリアル](/tutorial/tutorial.html)から React がどういうものかを学びましょう。

source: - [Try React](#try-react) - [Learn React](#learn-react) - [Staying Informed](#staying-informed) - [Versioned Documentation](#versioned-documentation) - [Something Missing?](#something-missing)
ja: - [React を試す](#try-react) - [React を学ぶ](#learn-react) - [最新の情報を追いたい人へ](#staying-informed) - [バージョン管理されたドキュメント](#versioned-documentation) - [足りないものがある？](#something-missing)

source: ## Try React {#try-react}
ja: ## React を試す {#try-react}

source: React has been designed from the start for gradual adoption, and
ja: React は当初より、既存のプロジェクトに徐々に追加していけるようなデザインとなっています。

source: **you can use as little or as much React as you need.
ja: **たくさん React を使うのでも、少しだけ使うのでも構いません。

source: ** Whether you want to get a taste of React, add some interactivity to a simple HTML page, or start a complex React-powered app, the links in this section will help you get started.
ja: **触りだけやってみるもよし、シンプルな HTML のページにインタラクティブな機能を追加するのに使うもよし、React をフル活用した複雑なアプリを作成するもよし。どのような目的にしても、このページにあるリンクが役に立つでしょう。

source: ### Online Playgrounds {#online-playgrounds}
ja: ### Web 上で試せるオンラインエディタ {#online-playgrounds}

source: If you're interested in playing around with React, you can use an online code playground.
ja: React をちょっと試してみたい場合、Web 上のコードエディタが使えます。

source: Try a Hello World template on [CodePen](codepen://hello-world), [CodeSandbox](https://codesandbox.io/s/new), or [Stackblitz](https://stackblitz.com/fork/react).
ja: [CodePen](codepen://hello-world)、[CodeSandbox](https://codesandbox.io/s/new) や [Stackblitz](https://stackblitz.com/fork/react) で Hello World のテンプレートを使って試してみましょう。

source: If you prefer to use your own text editor, you can also [download this HTML file](https://raw.githubusercontent.com/reactjs/reactjs.org/main/static/html/single-file-example.html), edit it, and open it from the local filesystem in your browser.
ja: 自前のテキストエディタを使いたい場合は、[この HTML ファイル](https://raw.githubusercontent.com/reactjs/reactjs.org/master/static/html/single-file-example.html)をダウンロード・編集して、ブラウザを使ってからローカルファイルシステムから開くことができます。

source: It does a slow runtime code transformation, so we'd only recommend using this for simple demos.
ja: ランタイムでの遅いコード変換が行われる為、簡単なデモに留めておくことをおすすめします。

source: ### Add React to a Website {#add-react-to-a-website}
ja: ### React を Web サイトに追加する {#add-react-to-a-website}

source: You can [add React to an HTML page in one minute](/docs/add-react-to-a-website.html).
ja: [React は HTML ページにすぐに追加することができます](/docs/add-react-to-a-website.html)。

source: You can then either gradually expand its presence, or keep it contained to a few dynamic widgets.
ja: そのあと徐々に全体に反映させていくか、少数のダイナミックなウィジェットに留めるかはあなたの自由です。

source: ### Create a New React App {#create-a-new-react-app}
ja: ### 新規 React アプリの作成 {#create-a-new-react-app}

source: When starting a React project, a [simple HTML page with script tags](/docs/add-react-to-a-website.html) might still be the best option.
ja: 新しく React のプロジェクトを始めたい場合でも、まずは[シンプルな HTML ページに script タグを追加](/docs/add-react-to-a-website.html)するのがおすすめです。

source: It only takes a minute to set up!
ja: 数分でセットアップできます！

source: As your application grows, you might want to consider a more integrated setup.
ja: アプリが成長するにつれて、より統合されたセットアップを行うことを考慮していきましょう。

source: There are several JavaScript toolchains we recommend for larger applications.
ja: 大きいアプリの場合におすすめの様々な JavaScript を用いたツールチェインが存在します。

source: Each of them can work with little to no configuration and lets you take full advantage of the rich React ecosystem.
ja: それぞれわずかな設定、もしくは設定要らずでリッチな React のエコシステムをフル活用できます。

source: [Learn how.](/docs/create-a-new-react-app.html)
ja: [詳細はこちら。](/docs/create-a-new-react-app.html)

source: ## Learn React {#learn-react}
ja: ## React を学ぶ {#learn-react}

source: People come to React from different backgrounds and with different learning styles.
ja: React を学びたい人には様々な背景があり、それぞれいろんな学び方のスタイルがあるでしょう。

source: Whether you prefer a more theoretical or a practical approach, we hope you'll find this section helpful.
ja: 理論から学びたい人も、実際に手を動かしながら学びたい人も、このセクションが役に立てれば幸いです。

source: * If you prefer to **learn by doing**, start with our [practical tutorial](/tutorial/tutorial.html).
ja: * **実際に手を動かしながら学びたい人**は[チュートリアル](/tutorial/tutorial.html)からはじめましょう。

source: * If you prefer to **learn concepts step by step**, start with our [guide to main concepts](/docs/hello-world.html).
ja: * **コンセプトからひとつひとつ学んでいきたい人**は[こちらのガイド](/docs/hello-world.html)からはじめていきましょう。

source: Like any unfamiliar technology, React does have a learning curve.
ja: 他の新しい技術を新しく学ぶ時と同様、React にも学習コストがあります。

source: With practice and some patience, you *will* get the hang of it.
ja: しかし、辛抱強く、地道にコツコツやっていくことで、*絶対に*できるようになります。

source: ### First Examples {#first-examples}
ja: ### 最初の例 {#first-examples}

source: The [React homepage](/) contains a few small React examples with a live editor.
ja: [React のホームページ](/)にはライブエディタにて記入できる小さな React のサンプルがいくつか載っています。

source: Even if you don't know anything about React yet, try changing their code and see how it affects the result.
ja: まだ React のことを何も知らなくても、実際に触ってみてどのように変化するか見てみましょう。

source: ### React for Beginners {#react-for-beginners}
ja: ### React 初心者向けのガイド {#react-for-beginners}

source: If you feel that the React documentation goes at a faster pace than you're comfortable with, check out [this overview of React by Tania Rascia](https://www.taniarascia.com/getting-started-with-react/).
ja: もし、React の公式ドキュメントのペースが早すぎると感じた場合は、[Tania Rascia 氏によって書かれた React の概要](https://www.taniarascia.com/getting-started-with-react/)を読んでみましょう。

source: It introduces the most important React concepts in a detailed, beginner-friendly way.
ja: React の重要なコンセプトについて詳細に説明されており、初心者にもとても易しい作りとなっています。

source: Once you're done, give the documentation another try!
ja: それが終わったら、もう一度公式ドキュメントを読んでみましょう！

source: ### React for Designers {#react-for-designers}
ja: ### デザイナ向けのガイド {#react-for-designers}

source: If you're coming from a design background, [these resources](https://reactfordesigners.com/) are a great place to get started.
ja: もしあなたがデザイナのバックグラウンドを持っているなら、[これらの資料](https://reactfordesigners.com/)から始めることをおすすめします。

source: ### JavaScript Resources {#javascript-resources}
ja: ### JavaScript 資料 {#javascript-resources}

source: The React documentation assumes some familiarity with programming in the JavaScript language.
ja: React の公式ドキュメントはあなたがある程度 JavaScript について知っていることを想定しています。

source: You don't have to be an expert, but it's harder to learn both React and JavaScript at the same time.
ja: JavaScript の達人である必要は全くありませんが、JavaScript と React を同時に習得するのは難しいでしょう。

source: We recommend going through [this JavaScript overview](https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript) to check your knowledge level.
ja: JavaScript について自分がどれだけ知っているかを知るために、[この JavaScript の概要](https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript)を読んでおくことをおすすめします。

source: It will take you between 30 minutes and an hour but you will feel more confident learning React.
ja: 読むのに 30 分から 1 時間程かかってしまいますが、React を学ぶための自信へと繋がってくるでしょう。

source: >Tip > >Whenever you get confused by something in JavaScript, [MDN](https://developer.mozilla.org/en-US/docs/Web/JavaScript) and [javascript.info](https://javascript.info/) are great websites to check.
ja: > ヒント > >もし JavaScript で何か詰まった時は、[MDN](https://developer.mozilla.org/en-US/docs/Web/JavaScript) と [javascript.info](https://javascript.info/) を確認すると良いでしょう。

source: There are also [community support forums](/community/support.html) where you can ask for help.
ja: また、[コミュニティ運営の掲示板](/community/support.html)を活用するのもおすすめします。

source: ### Practical Tutorial {#practical-tutorial}
ja: ### 実践チュートリアル {#practical-tutorial}

source: If you prefer to **learn by doing,** check out our [practical tutorial](/tutorial/tutorial.html).
ja: **実際に手を動かしながら学びたい人**は[チュートリアル](/tutorial/tutorial.html)からはじめましょう。

source: In this tutorial, we build a tic-tac-toe game in React.
ja: このチュートリアルでは React を使って三目並べゲームを作成します。

source: You might be tempted to skip it because you're not into building games -- but give it a chance.
ja: ゲーム作成に興味が無い方は飛ばそうと思うかもしれませんが、試してみてください。

source: The techniques you'll learn in the tutorial are fundamental to building *any* React apps, and mastering it will give you a much deeper understanding.
ja: ここで学ぶテクニックは*全ての* React アプリの基礎となることであり、習得することで React に関する深い理解が得られます。

source: ### Step-by-Step Guide {#step-by-step-guide}
ja: ### 一歩づつ進めるためのガイド {#step-by-step-guide}

source: If you prefer to **learn concepts step by step,** our [guide to main concepts](/docs/hello-world.html) is the best place to start.
ja: **コンセプトからひとつひとつ学んでいきたい人**は[こちらのガイド](/docs/hello-world.html)からはじめていきましょう。

source: Every next chapter in it builds on the knowledge introduced in the previous chapters so you won't miss anything as you go along.
ja: このガイドは章ごとに分かれていて、各章がそれまでに習ったことを上乗せする知識となっているため、余すことなく学ぶことができます。

source: ### Thinking in React {#thinking-in-react}
ja: ### React 的な考え方 {#thinking-in-react}

source: Many React users credit reading [Thinking in React](/docs/thinking-in-react.html) as the moment React finally "clicked" for them.
ja: 多くの React のユーザは [React の流儀](/docs/thinking-in-react.html)を読んだ時に React についてピンときたと高く評価しています。

source: It's probably the oldest React walkthrough but it's still just as relevant.
ja: この世に存在する一番古い React に関する資料ですが、今でも現役で使えます。

source: ### Recommended Courses {#recommended-courses}
ja: ### おすすめの資料 {#recommended-courses}

source: Sometimes people find third-party books and video courses more helpful than the official documentation.
ja: 時には第三者が執筆した技術書やオンラインコース等が公式ドキュメントよりもわかりやすいという人もいます。

source: We maintain [a list of commonly recommended resources](/community/courses.html), some of which are free.
ja: 我々は[よく勧められている資料集](/community/courses.html)についてもまとめています。無料のものもあります。

source: ### Advanced Concepts {#advanced-concepts}
ja: ### 高度なコンセプト {#advanced-concepts}

source: Once you're comfortable with the [main concepts](/docs/hello-world.html) and played with React a little bit, you might be interested in more advanced topics.
ja: React の[基本コンセプト](/docs/hello-world.html)について慣れてきて、実際に手で動かしてみたら、今度はさらに高度な内容にも手を出したいと思うかもしれません。

source: This section will introduce you to the powerful, but less commonly used React features like [context](/docs/context.html) and [refs](/docs/refs-and-the-dom.html).
ja: この資料では強力な、しかし普段使われることのない [コンテクスト](/docs/context.html) や [ref](/docs/refs-and-the-dom.html) といった React のさらなる機能について紹介します。

source: ### API Reference {#api-reference}
ja: ### API リファレンス {#api-reference}

source: This documentation section is useful when you want to learn more details about a particular React API.
ja: この資料は特定の React API の詳細について学びたいときに役に立つでしょう。

source: For example, [`React.Component` API reference](/docs/react-component.html) can provide you with details on how `setState()` works, and what different lifecycle methods are useful for.
ja: 例えば、[`React.Component` API リファレンス](/docs/react-component.html)では `setState()` がどう機能しているかについてより詳細に記載されていたり、種々のライフサイクルメソッドがどのように役に立つかについて書かれています。

source: ### Glossary and FAQ {#glossary-and-faq}
ja: ### 用語集と FAQ {#glossary-and-faq}

source: The [glossary](/docs/glossary.html) contains an overview of the most common terms you'll see in the React documentation.
ja: この[用語集](/docs/glossary.html)にはこのドキュメントにてよく使われる単語等が記載されています。

source: There is also a FAQ section dedicated to short questions and answers about common topics, including [making AJAX requests](/docs/faq-ajax.html), [component state](/docs/faq-state.html), and [file structure](/docs/faq-structure.html).
ja: FAQ もあり、[AJAX リクエストについて](/docs/faq-ajax.html)、[コンポーネントの state](/docs/faq-state.html)、[ファイル構成](/docs/faq-structure.html)などのよくある質問とそれらに対する回答が記載されています。

source: ## Staying Informed {#staying-informed}
ja: ## 最新の情報を追いたい人へ {#staying-informed}

source: The [React blog](/blog/) is the official source for the updates from the React team.
ja: [React ブログ](/blog/)は React チームからのアップデートが記載されている公式ブログです。

source: Anything important, including release notes or deprecation notices, will be posted there first.
ja: リリースノートや機能の非推奨化の告知など、何か大事な発表がある時にはこのブログに真っ先に記載されます。

source: You can also follow the [@reactjs account](https://twitter.com/reactjs) on Twitter, but you won't miss anything essential if you only read the blog.
ja: 他にも [@reactjs](https://twitter.com/reactjs) のツイッターアカウントをフォローすることもできますが、公式ブログを追っていれば大事なことを見落とすことはないでしょう。

source: Not every React release deserves its own blog post, but you can find a detailed changelog for every release in the [`CHANGELOG.md` file in the React repository](https://github.com/facebook/react/blob/main/CHANGELOG.md), as well as on the [Releases](https://github.com/facebook/react/releases) page.
ja: 全ての React のリリースにブログ記事があるわけではありませんが、リリースごとに詳細に書かれた changelog が [React リポジトリの `CHANGELOG.md`](https://github.com/facebook/react/blob/master/CHANGELOG.md)、および [Releases ページ](https://github.com/facebook/react/releases)に記載されています。

source: ## Versioned Documentation {#versioned-documentation}
ja: ## バージョン管理されたドキュメント {#versioned-documentation}

source: This documentation always reflects the latest stable version of React.
ja: このドキュメントは常に最新の stable 版の React に準拠しています。

source: Since React 16, you can find older versions of the documentation on a [separate page](/versions).
ja: React 16 からは古いバージョンのドキュメントも[別のページ](/versions)から閲覧できます。

source: Note that documentation for past versions is snapshotted at the time of the release, and isn't being continuously updated.
ja: 古いバージョンのドキュメントは各バージョンリリース時のスナップショットであり、更新をかけることはありません。

source: ## Something Missing?
ja: ## 他に聞きたいことは？

source: If something is missing in the documentation or if you found some part confusing, please [file an issue for the documentation repository](https://github.com/reactjs/reactjs.org/issues/new) with your suggestions for improvement, or tweet at the [@reactjs account](https://twitter.com/reactjs).
ja: ドキュメントに記載されていないことがあったり、わかりにくい箇所があったりしたら、困ったことや改善案等を[この公式ドキュメントのリポジトリ](https://github.com/reactjs/reactjs.org/issues/new)に issue として立てるか、もしくは公式の [@reactjs](https://twitter.com/reactjs) までご連絡ください。

source: We love hearing from you!
ja: あなたのご意見をお待ちしております！
